<?php

// Расширим этот массив — создадим новый, в котором будет много авторов и много книг.
// Создайте новый многомерный массив $result2 с двумя ключами — 'authors' и 'books':
// 1. В индекс (ключ) 'authors' добавьте многомерный массив, каждый элемент которого является автором,
// т. е. ассоциативным массивом данных об авторе: ФИО, email (как в задании 3);
// 2. В индекс (ключ) 'books' добавьте многомерный массив, каждый элемент которого является книгой,
//т. е. ассоциативным массивом данных о книге: название и email автора (как в задании 3);

$result2 = [
    'authors' => [
        ['authorName' => 'Писателев Петр Андреевич', 'email' => 'pisatelev@mail.ru'],
        ['authorName' => 'Творцов Артем Игоривич', 'email' => 'tvortsov@mail.ru'],
        ['authorName' => 'Написаев Олег Евгениевич', 'email' => 'napisaev@mail.ru'],
        ['authorName' => 'Перепесун Игорь Иванович', 'email' => 'perepesun@mail.ru']
    ],
    'books' => [
        ['bookName' => 'Что делать?', 'email' => 'pisatelev@mail.ru'],
        ['bookName' => 'Виды дрелей или как испортить жизнь соседям', 'email' => 'tvortsov@mail.ru'],
        ['bookName' => '10 способов поднять самооценку', 'email' => 'napisaev@mail.ru'],
        ['bookName' => 'Кто виноват?', 'email' => 'perepesun@mail.ru']
    ]
];

//Используя данные из созданного массива, сформируйте и выведите строку, подставив данные вместо блоков,
//обрамлённых решётками: В нашей библиотеке точно есть две книги, которые вы ищете:
//#Название 1-й книги# и #Название 2-й книги#.

var_dump('В нашей библиотеке точно есть две книги, которые вы ищете: "' . $result2["books"][1]["bookName"] . '" и "' . $result2["books"][2]["bookName"] . '".');

//Используя данные из созданного массива, сформируйте и выведите строку, подставив данные вместо блоков,
//обрамлённых решётками:
//Пожалуйста, перестаньте писать гневные письма на адрес нашего любимого автора #Фио 1-го автора#
//(#Email 1-го автора#). Пишите их лучше другому нашему автору — #Фио 2-го автора# (#Email 2-го автора#),
//мы его любим поменьше.

var_dump('Пожалуйста, перестаньте писать гневные письма на адрес нашего любимого автора ' . $result2["authors"][2]["authorName"] . ' (' . $result2["authors"][2]["email"] . '). Пишите их лучше другому нашему автору — ' . $result2["authors"][3]["authorName"] . ' (' . $result2["authors"][3]["email"] . '), мы его любим поменьше.');
