<?php

// Создайте ещё два числа: $daysBeforeExam — количество дней до экзамена,
// $daysToPrepareForExam — количество дней для подготовки к экзамену.
// Поместите в них случайное число от 0 до 9 (используйте функцию rand(0, 9)).

$daysBeforeExam = rand(0,9);
$daysToPrepareForExam = rand(0,9);

//Используя тернарный оператор, определите, больше ли дней нужно на подготовку к экзамену,
//чем осталось до него. Если это так, выведите «Мне крышка».
// Если нет, выведите «Главное — не расслабляться».

$exam = $daysToPrepareForExam > $daysBeforeExam ? 'Мне крышка' : 'Главное — не расслабляться';
var_dump($exam);

//Используя тернарный оператор, определите, меньше ли дней нужно на подготовку к экзамену,
//чем осталось до него. Если это так, выведите «Ууу, ещё успею в дотку поиграть».
//Если нет, выведите «Успею или не успею».

$exam = $daysToPrepareForExam < $daysBeforeExam ? 'Ууу, ещё успею в дотку поиграть' : 'Успею или не успею';
var_dump($exam);

//Используя тернарный оператор, определите, равное ли количество дней осталось до экзамена и на подготовку к нему.
//Если это так, выведите «Впритирочку». Если нет, выведите «Либо все плохо, либо очень плохо».

$exam = $daysToPrepareForExam == $daysBeforeExam ? 'Впритирочку' : 'Либо все плохо, либо очень плохо';
var_dump($exam);