<!--Задание 1-->
<!--Что нужно сделать-->
<!--Откройте приложенный файл library.php.-->
<!--В этом файле заранее созданы переменные с данными:-->
<!--массив $library — это массив с авторами и книгами, который мы делали в предыдущих модулях;-->
<!--переменная $title — это заголовок страницы библиотеки;-->
<!--переменная $red типа boolean принимает случайным образом true или false.-->
<!--Интегрируйте вёрстку этой страницы библиотеки:-->
<!--выведите заголовок окна браузера в теге H1, взяв его из переменной $title;-->
<!--в отдельных абзацах выведите книги в том же формате, что и в задании из предыдущего модуля: Книга <Название книги>, её написал <ФИО автора> <Год рождения автора> (<email автора>).-->
<!--Реализуйте условие: если переменная $red истинна, необходимо к заголовку H1 добавить атрибут class="red", чтобы он выводился красным цветом.-->

<!--Задание 2-->
<!--Что нужно сделать-->
<!--Необходимо добавить несколько новых стилей на страницу, дописав новые CSS-стили и добавив новые теги и классы тегам:-->
<!--названия книг выведите жирным начертанием и установите размер шрифта 16px;-->
<!--email автора выведите в виде ссылки;-->
<!--нечётные абзацы выделите отдельным классом и добавьте им сероватый цвет фона (#dddddd);-->
<!--добавьте отступ всей странице по горизонтали — 40px слева и справа;-->
<!--добавьте отступы 20px между книгами.-->
<!---->
<!--Советы и рекомендации-->
<!--Не используйте инлайновые стили, используйте CSS-классы и привязанные к ним стили.-->
<!--Вынесите все стили, в том числе и класс .red, в новый CSS-класс и подключите его. Это лучше, чем указать все стили непосредственно на главной странице нашей библиотеки.-->
<!--Никакие теги не должны быть выведены оператором echo или помещены в переменные.-->
<?php

$library = [
    'authors' => [
        'john_makkormik@example.com' => [
            'name' => 'Джон Маккормик',
            'email' => 'john_makkormik@example.com',
            'birthYear' => 1972,
        ],
        'martin_robert@example.com' => [
            'name' => 'Мартин Роберт',
            'email' => 'martin_robert@example.com',
            'birthYear' => 1952,
        ],
        'martin_fauler@example.com' => [
            'name' => 'Мартин Фаулер',
            'email' => 'martin_fauler@example.com',
            'birthYear' => 1963,
        ],
    ],
    'books' => [
        [
            'title' => 'Чистый код: создание, анализ и рефакторинг',
            'author' => 'martin_robert@example.com',
            'year' => 2013,
        ],
        [
            'title' => 'Девять алгоритмов, которые изменили будущее',
            'author' => 'john_makkormik@example.com',
            'year' => 2011,
        ],
        [
            'title' => 'Идеальный программист',
            'author' => 'martin_robert@example.com',
            'year' => 2011,
        ],
        [
            'title' => 'Шаблоны корпоративных приложений',
            'author' => 'martin_fauler@example.com',
            'year' => 2002,
        ],
    ],
];

$title = 'Библиотека программиста';

$red = (bool)rand(0, 1);

?>
<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title><?php echo $title ?></title>
    <link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<h1 <?php if ($red) {
    echo "class=\"red\"";
} ?>><?php echo $title ?></h1>
<div>Авторов на портале: <?php echo count($library['authors']) ?></div>
<!-- Выведите все книги -->
<p><?php
    foreach ($library['books'] as $val) {
        $emailAuthor = $val['author'];
        $bookTitle = $val['title'];
        $authorName = $library['authors'][$emailAuthor]['name'];
        $authorBirthYear = $library['authors'][$emailAuthor]['birthYear'];
        $authorEmail = $val['author'];
        echo "<p class='tr, books'>Книга <span class='bookTitle'>\"$bookTitle\"</span> , её написал $authorName $authorBirthYear года рождения (<a href='#'>$authorEmail</a>>).</p>";
    }
    ?></p>

</body>
</html>
